Repository: bluesky-social/atproto
Catalog: packages/oauth/oauth-provider-frontend/src/locales/*/messages.po
Languages: es, ja

source: @handle or email
es: @usuario o correo electrónico
ja: @ハンドルまたはメールアドレス

source: ← Back to accounts
es: ← Volver a cuentas
ja: ← アカウントに戻る

source: A local app
es: Una app local
ja: ローカルアプリ

source: A new password is required
es: Se requiere una nueva contraseña
ja: 新しいパスワードが必要です

source: Accounts
es: Cuentas
ja: アカウント

source: An error occurred, please try again.
es: Ocurrió un error, inténtalo de nuevo por favor.
ja: エラーが発生しました、もう一度お試しください。

source: Are you sure you want to remove this device?
es: ¿Estás seguro de que quieres remover este dispositivo?
ja: 本当にこのデバイスを削除しますか？

source: Are you sure you want to revoke access? This application won't be able to access your account anymore.
es: ¿Estás seguro de que quieres revocar el acceso? Esta aplicación no podrá acceder a tu cuenta.
ja: 本当にこのデバイスを削除しますか？このアプリケーションは、もうあなたのアカウントにアクセスできなくなります。

source: Back to sign in
es: Volver al inicio de sesión
ja: サインインに戻る

source: Branding
es: Marca
ja: ブランド

source: Cancel
es: Cancelar
ja: キャンセル

source: Click here to send a new code to your email.
es: Haz clic aquí para enviar un nuevo código a tu correo electrónico.
ja: ここをクリックして、新しいコードをメールで送信します。

source: Code
es: Código
ja: コード

source: Code was resent
es: El código ha sido reenviado
ja: コード再送済

source: Connected apps
es: Aplicaciones conectadas
ja: 接続済アプリ

source: Credentials
es: Credenciales
ja: 認証情報

source: Don't see the email? <0>Try sending again.</0>
es: ¿No ves el correo electrónico? <0>Intenta enviar de nuevo.</0>
ja: メールが見つかりませんか？<0>再送信を試みてください。</0>

source: Email
es: Correo electrónico
ja: メールアドレス

source: Email code is required
es: Se requiere el código del correo electrónico
ja: メールの確認コードが必要

source: Email is required
es: Se requiere un correo electrónico
ja: メールアドレスが必要

source: Enter a new password
es: Ingresa una nueva contraseña
ja: 新しいパスワードを入力

source: Enter your email
es: Ingresa tu correo electrónico
ja: メールアドレスを入力

source: Enter your email to receive a reset code.
es: Ingresa tu correo electrónico para recibir un código de reinicio.
ja: リセットコードを受信するには、メールアドレスを入力してください。

source: Failed to load connected apps
es: Error al cargar las aplicaciones conectadas
ja: 接続済アプリの読み込みに失敗しました

source: Failed to load devices
es: Error al cargar los dispositivos
ja: デバイスの読み込みに失敗しました

source: Failed to remove device
es: Error al remover el dispositivo
ja: デバイスの削除に失敗しました

source: Failed to resend code
es: Error al reenviar el código
ja: 確認コードの再送に失敗しました

source: Failed to sign out
es: Error al cerrar sesión
ja: サインアウトに失敗しました

source: Forgot password?
es: ¿Olvidaste tu contraseña?
ja: パスワードを忘れた？

source: Get reset code
es: Obtener un código de reinicio
ja: リセットコードを取得

source: Home
es: Inicio
ja: ホーム

source: Identifier
es: Identificador
ja: 識別子

source: Invalid email
es: Correo electrónico inválido
ja: 無効なメールアドレス

source: Invalid handle
es: Usuario inválido
ja: 無効なハンドル

source: Invalid identifier or password.
es: Identificador o contraseña inválidos.
ja: 無効な識別子またはパスワード

source: It appears that you haven’t used this account to sign in to any apps yet.
es: Parece que aún no has usado esta cuenta para iniciar sesión en ninguna aplicación.
ja: このアカウントを使用して、まだアプリにサインインしていないようです。

source: Logo
ja: ロゴ

source: Looks like you aren't logged in on any other devices.
es: Parece que no has iniciado sesión en otros dispositivos.
ja: あなたは他のデバイスにログインしていないようです。

source: loopback
ja: ループバック

source: My devices
es: Mis dispositivos
ja: デバイス

source: No connected apps
es: No hay aplicaciones conectadas
ja: 接続済アプリなし

source: No devices
es: No hay dispositivos
ja: デバイスなし

source: Password
es: Contraseña
ja: パスワード

source: Password is required
es: Se requiere la contraseña
ja: パスワードが必要

source: Password must be at least {MIN_PASSWORD_LENGTH} characters
es: La contraseña debe tener al menos {MIN_PASSWORD_LENGTH} caracteres
ja: パスワードは {MIN_PASSWORD_LENGTH} 文字以上でなければなりません

source: Privacy Policy
es: Política de privacidad
ja: プライバシーポリシー

source: Remove this device
es: Remover este dispositivo
ja: このデバイスを削除

source: Reset password
es: Restablecer contraseña
ja: パスワードをリセット

source: Revoke access
es: Revocar acceso
ja: アクセスを取り消す

source: Revoke access to {clientName}
es: Revocar acceso a {clientName}
ja: {clientName} へのアクセスを取り消す

source: Revoke access to this application
es: Revocar acceso a esta aplicación
ja: このアプリへのアクセスを取り消す

source: Select an account
es: Seleccionar una cuenta
ja: アカウントを選択

source: Select the account you would like to manage.
es: Selecciona la cuenta que quieres administrar.
ja: 管理したいアカウントを選択してください。

source: Sign in
es: Iniciar sesión
ja: サインイン

source: Sign in with another account
es: Iniciar sesión con otra cuenta
ja: 他のアカウントでサインイン

source: Sign out
es: Cerrar sesión
ja: サインアウト

source: Something went wrong
es: Algo salió mal
ja: 何らかの問題が発生したようです

source: Success!
es: ¡Éxito!
ja: 成功！

source: Successfully removed device
es: Dispositivo removido exitosamente
ja: デバイスの削除に成功しました

source: Successfully signed out
es: Sesión cerrada exitosamente
ja: サインアウトに成功しました

source: Support
es: Soporte
ja: サポート

source: Terms of Service
es: Términos del servicio
ja: 利用規約

source: This device
es: Este dispositivo
ja: このデバイス

source: This is a list of all the applications you have authorized to access your account.
es: Esta es una lista de todas las aplicaciones que has autorizado para acceder a tu cuenta.
ja: このリストは、あなたのアカウントへのアクセスを許可したすべてのアプリケーションの一覧です。

source: This is a list of all the devices you have used to sign in to your account. New apps can be authorized from any of these devices. If you believe that your account has been compromised, we recommend that you revoke access to all devices.
es: Esta es una lista de todos los dispositivos que has utilizado para iniciar sesión en tu cuenta. Se pueden autorizar nuevas aplicaciones desde cualquiera de estos dispositivos. Si crees que tu cuenta ha sido comprometida, te recomendamos que revoques el acceso a todos los dispositivos.
ja: このリストは、あなたのアカウントにサインインするために使用したすべてのデバイスの一覧です。これらのデバイスのいずれかから新しいアプリを認証できます。アカウントが侵害されたと思われる場合は、すべてのデバイスへのアクセスを取り消すことをお勧めします。

source: Unknown user agent
es: Agente de usuario desconocido
ja: 不明なユーザーエージェント

source: User avatar
es: Avatar de usuario
ja: ユーザーのアバター

source: View and manage account for {0}
es: Ver y administrar cuenta para {0}
ja: {0} のアカウントを表示および管理

source: We weren't able to load your accounts. Please refresh the page to try again.
es: No pudimos cargar tus cuentas. Por favor, actualiza la página para intentarlo de nuevo.
ja: アカウントを読み込めませんでした。ページを更新してもう一度お試しください。

source: Whoops! An error occurred.
es: ¡Ups! Ocurrió un error.
ja: おっと！エラーが発生しました。

source: Your account
es: Tu cuenta
ja: あなたのアカウント

source: Your password has been reset.
es: Tu contraseña ha sido restablecida.
ja: あなたのパスワードはリセットされました。
