Repository: bluesky-social/atproto
Catalog: packages/oauth/oauth-provider-ui/src/locales/*/messages.po
Languages: es

source: 2FA Confirmation
es: Confirmación de doble factor

source: A second authentication factor is required
es: Se requiere un segundo factor de autenticación

source: A service controlled by <0>{domain}</0>
es: Un servicio controlado por <0>{domain}</0>

source: Account
es: Cuenta

source: Already have a code?
es: ¿Ya tienes un código?

source: An application on your device
es: Una aplicación en tu dispositivo

source: An unknown error occurred
es: Ocurrió un error desconocido

source: Another account
es: Otra cuenta

source: Any collection
es: Cualquier colección

source: Any method
es: Cualquier método

source: Any service
es: Cualquier servicio

source: Authenticate
es: Autenticar

source: Authorize
es: Autorizar

source: Back
es: Volver

source: Between {minLength} and {maxLength} characters
es: Entre {minLength} y {maxLength} caracteres

source: Blob storage
es: Almacenamiento de blobs

source: Bluesky App services
es: Servicios de la app Bluesky

source: Bluesky Chat services
es: Servicios de chat de Bluesky

source: By clicking <0>{0}</0>, you will grant this application access to your account in accordance with its <1>terms of service</1> and <2>privacy policy</2>.
es: Al hacer clic en <0>{0}</0>, otorgarás a esta aplicación acceso a tu cuenta de acuerdo con sus <1>términos de servicio</1> y <2>política de privacidad</2>.

source: By creating an account you agree to the {0} and the {1} of this service.
es: Al crear una cuenta, aceptas los {0} y la {1} de este servicio.

# RPC lxm
source: Call
es: Llamar

source: Cancel
es: Cancelar

source: Change your <0>@handle</0>
es: Cambiar tu <0>@usuario</0>

source: Check your {0} email for a login code and enter it here.
es: Revisa tu correo electrónico {0} para encontrar un código de inicio de sesión e ingrésalo aquí.

source: Choose a username
es: Elige un nombre de usuario

source: Code
es: Código

source: Collapse details
es: Ocultar detalles

source: Collection
es: Colección

# verb
source: Confirm
es: Confirmar

source: Confirm your password to continue
es: Confirma tu contraseña para continuar

source: Confirmation code
es: Código de confirmación

source: Create
es: Crear

source: Create a new account
es: Crear una nueva cuenta

source: Create Account
es: Crear cuenta

source: Create, update, and delete any public record
es: Crear, actualizar y eliminar cualquier registro público

source: Delete
es: Eliminar

source: Deny access
es: Denegar acceso

source: Description
es: Descripción

source: Email
es: Correo electrónico

source: Email address
es: Dirección de correo electrónico

source: Enter a password
es: Ingresa una contraseña

source: Enter the code you received to reset your password.
es: Ingresa el código que recibiste para restablecer tu contraseña.

source: Enter the email you used to create your account. We'll send you a "reset code" so you can set a new password.
es: Ingresa el correo electrónico que usaste para crear tu cuenta. Te enviaremos un "código de restablecimiento" para que puedas establecer una nueva contraseña.

source: Enter your email address
es: Ingresa tu dirección de correo electrónico

source: Enter your new password
es: Ingresa tu nueva contraseña

source: Enter your password
es: Ingresa tu contraseña

source: Enter your username and password
es: Ingresa tu nombre de usuario y contraseña

source: example-com-xxxxx-xxxxx
es: ejemplo-com-xxxxx-xxxxx

source: Expand details
es: Ver detalles

source: Forgot Password
es: Contraseña olvidada

source: Forgot?
es: ¿Olvidaste?

source: Grant access to your <0>{0}</0> account
es: Otorgar acceso a tu cuenta <0>{0}</0>

source: Having trouble? <0>Contact support</0>
es: ¿Tienes problemas? <0>Contacta al soporte</0>

source: Hide
es: Ocultar

source: Home
es: Inicio

source: Identifier
es: Identificador

source: Identity
es: Identidad

source: Interface language selector
es: Selector de idioma de la interfaz

source: Invalid
es: Inválido

source: Invite code
es: Código de invitación

source: Let's get your password reset!
es: ¡Vamos a restablecer tu contraseña!

source: Login complete
es: Inicio de sesión completo

source: Login to account that is not listed
es: Iniciar sesión en una cuenta que no está en la lista

source: Looks like {example}
es: Similar a {example}

source: Make visible
es: Hacer visible

source: Manage your <0>full identity</0> including your <1>@handle</1>
es: Administrar tu <0>identidad completa</0> incluyendo tu <1>@usuario</1>

source: Manage your profile, posts, likes and follows
es: Administrar tu perfil, publicaciones, 'me gusta' y seguidos

source: Manage your profile, posts, likes and follows as well as read your private preferences
es: Administrar tu perfil, publicaciones, 'me gusta' y seguidos, así como leer tus preferencias privadas

source: Missing
es: Faltante

source: Moderate
es: Moderada

source: Name
es: Nombre

source: New password
es: Nueva contraseña

source: Next
es: Siguiente

source: Okay
es: Aceptar

source: Only letters, numbers, and hyphens
es: Solo letras, números y guiones

source: Password
es: Contraseña

source: Password strength
es: Fortaleza de la contraseña

source: Password strength indicator
es: Indicador de fortaleza de la contraseña

source: Password Updated
es: Contraseña actualizada

source: Password updated!
es: ¡Contraseña actualizada!

source: Password with at least {MIN_PASSWORD_LENGTH} characters
es: Contraseña con al menos {MIN_PASSWORD_LENGTH} caracteres

source: Perform actions on your behalf
es: Realizar acciones en tu nombre

source: Perform authenticated actions towards <0>any service</0> on your behalf
es: Realizar acciones autenticadas hacia <0>cualquier servicio</0> en tu nombre

source: Please verify the domain name of the website before entering your password. Never enter your password on a domain you do not trust.
es: Por favor, verifica el nombre de dominio del sitio web antes de ingresar tu contraseña. Nunca ingreses tu contraseña en un dominio en el que no confíes.

source: Privacy Policy
es: Política de privacidad

source: Publish changes
es: Publicar cambios

source: Read and send messages
es: Leer y enviar mensajes

source: Read and update your account's email address
es: Leer y actualizar la dirección de correo electrónico de tu cuenta

source: Read your account's email address
es: Leer la dirección de correo electrónico de tu cuenta

source: Remember this account on this device
es: Recordar esta cuenta en este dispositivo

source: Repository
es: Repositorio

source: Reset code
es: Código de restablecimiento

source: Reset Password
es: Restablecer contraseña

source: Reset your password
es: Restablecer tu contraseña

source: Select domain
es: Seleccionar dominio

source: Select from an existing account
es: Seleccionar desde una cuenta existente

# verb
source: Sign in
es: Iniciar sesión

# noun
source: Sign in
es: Iniciar sesión

source: Sign in as {0}
es: Iniciar sesión como {0}

source: Sign in as...
es: Iniciar sesión como...

source: Sign up
es: Registrarse

source: Step {currentPosition} of {count}
es: Paso {currentPosition} de {count}

source: Strong
es: Fuerte

source: Submit
es: Enviar

source: Support
es: Soporte

source: Technical details
es: Detalles técnicos

source: Temporarily activate or deactivate your account
es: Activar o desactivar temporalmente tu cuenta

source: Terms of Service
es: Términos de servicio

source: That handle cannot be used
es: Ese usuario no puede ser utilizado

source: The application is asking for full control over your network identity, meaning that it could <0>permanently break</0>, or even <1>steal</1>, your account. Only grant this permission to applications you really trust.
es: La aplicación está solicitando el control total sobre tu identidad en la red, lo que significa que podría <0>romper permanentemente</0>, o incluso <1>robar</1>, tu cuenta. Solo otorga este permiso a aplicaciones en las que realmente confíes.

source: The application is asking to be able to create, update, and delete <0>any data</0> from your repository.
es: La aplicación está solicitando poder crear, actualizar y eliminar <0>cualquier dato</0> de tu repositorio.

source: The application requests the permissions necessary to perform the following actions on your behalf:
es: La aplicación solicita los permisos necesarios para realizar las siguientes acciones en tu nombre:

source: The ATProto network uses an authentication mechanism that allows to uniquely identify users when communicating with external services. This is typically used to retrieve or update data linked to your account, such as feed or moderation content.
es: La red ATProto utiliza un mecanismo de autenticación que permite identificar unívocamente a los usuarios al comunicarse con servicios externos. Esto se usa típicamente para recuperar o actualizar datos vinculados a tu cuenta, como contenido de muros o moderación.

source: The data you submitted is invalid. Please check the form and try again.
es: Los datos que enviaste no son válidos. Por favor, revisa el formulario e inténtalo de nuevo.

source: The domain name is not allowed
es: El dominio no está permitido

source: The handle contains inappropriate language
es: El nombre de usuario contiene lenguaje inapropiado

source: The handle is already in use
es: El nombre de usuario ya está en uso

source: The handle is invalid
es: El nombre de usuario no es válido

source: The invite code is not valid
es: El código de invitación no es válido

source: This application is requesting the following list of technical permissions, summarized hereafter:
es: Esta aplicación está solicitando la siguiente lista de permisos técnicos, resumidos a continuación:

source: This authorization request has been denied. Please try again.
es: Esta solicitud de autorización ha sido denegada. Por favor, inténtalo de nuevo.

source: This email is already used
es: El correo electrónico ya está en uso

source: This handle is reserved
es: El nombre de usuario está reservado

source: This sign-in session has expired
es: Esta sesión de inicio de sesión ha expirado

# RPC aud
source: Towards
es: Hacia

source: Type your desired username
es: Escribe tu nombre de usuario deseado

source: Unexpected server response
es: Respuesta inesperada del servidor

source: Update
es: Actualizar

source: Upload files
es: Subir archivos

source: Username or email address
es: Nombre de usuario o dirección de correo electrónico

source: Valid
es: Válido

source: Verify you are human
es: Verifica que eres humano

source: wants to access your <0/> account
es: quiere acceder a tu cuenta <0/>

source: wants to uniquely identify you through your <0/> account
es: quiere identificarte de forma única a través de tu cuenta <0/>

source: Warning
es: Advertencia

source: We're so excited to have you join us!
es: ¡Nos alegra mucho tenerte con nosotros!

source: Weak
es: Débil

source: Wrong identifier or password
es: Identificador o contraseña incorrectos

source: You are being redirected...
es: Estás siendo redirigido...

source: You can change this username to any domain name you control after your account is set up.
es: Puedes cambiar este nombre de usuario a cualquier nombre de dominio que controles después de configurar tu cuenta.

source: You can now sign in with your new password.
es: Ahora puedes iniciar sesión con tu nueva contraseña.

source: You will receive an email with a "reset code". Enter that code here then enter your new password.
es: Recibirás un correo electrónico con un "código de restablecimiento". Ingresa ese código aquí y luego ingresa tu nueva contraseña.

source: Your account
es: Tu cuenta

source: Your full username will be: {0}
es: Tu nombre de usuario completo será: {0}

source: Your password has been updated!
es: ¡Tu contraseña ha sido actualizada!

source: Your repository contains all the data publicly available on the ATProto network, such as Bluesky posts, likes, and follows. It also contains data created through other apps you've signed into using this account.
es: Tu repositorio contiene todos los datos públicamente disponibles en la red ATProto, como publicaciones de Bluesky, 'me gusta' y seguidos. También contiene datos creados a través de otras aplicaciones en las que has iniciado sesión con esta cuenta.
